### DataFrame : Modificacion de los nombres de las filas

In [1]:
import numpy as np
import pandas as pd

In [2]:
filas = 'ventas1 ventas2 ventas3'.split()
columnas = 'zonaA zonaB zonaC'.split()
datos = [[100,200,250], [210,300,425], [250,310,124]]
dataframe = pd.DataFrame(datos, filas, columnas)

In [3]:
dataframe

         zonaA  zonaB  zonaC
ventas1    100    200    250
ventas2    210    300    425
ventas3    250    310    124

In [4]:
nuevas_filas = 'dia1 dia2 dia3'.split()
nuevas_filas

['dia1', 'dia2', 'dia3']

In [5]:
dataframe['dias'] = nuevas_filas
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    100    200    250  dia1
ventas2    210    300    425  dia2
ventas3    250    310    124  dia3

In [6]:
dataframe.set_index('dias')

      zonaA  zonaB  zonaC
dias
dia1    100    200    250
dia2    210    300    425
dia3    250    310    124

In [7]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    100    200    250  dia1
ventas2    210    300    425  dia2
ventas3    250    310    124  dia3

In [8]:
dataframe = dataframe.set_index('dias')

In [9]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    100    200    250
dia2    210    300    425
dia3    250    310    124